# Problem set 3: Loading and structuring data from Denmark Statistics

In [1]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('seaborn-whitegrid')
import pandas as pd
import ipywidgets as widgets

C:\Users\Bruger\AppData\Local\Temp\ipykernel_18464\2436448501.py:4: MatplotlibDeprecationWarning: The seaborn styles shipped by Matplotlib are deprecated since 3.6, as they no longer correspond to the styles shipped by seaborn. However, they will remain available as 'seaborn-v0_8-<style>'. Alternatively, directly use the seaborn API instead.
  plt.style.use('seaborn-whitegrid')

# Tasks

## Create a pandas DataFrame

Modify the code below such that *income* and *consumption* are variables in the *dt* DataFrame.

In [2]:
np.random.seed(1999)
 
N = 100
mydata = {}
mydata['id'] = range(N)

#income = np.exp(np.random.normal(size=N))
#consumption = np.sqrt(income)

mydata['income'] = np.exp(np.random.normal(size=N))
mydata['consumption'] = np.sqrt(mydata['income'])



dt = pd.DataFrame(mydata)
dt.head()

   id    income  consumption
0   0  0.727981     0.853218
1   1  1.997831     1.413447
2   2  0.276823     0.526140
3   3  1.481931     1.217346
4   4  1.235904     1.111712

**Answer:** see A01.py

## Create new variable

1) Add a new variable *ratio* which is the ratio of consumption to income.

In [3]:
# write your code here
dt['ratio']=dt.consumption/dt.income

dt.head()

   id    income  consumption     ratio
0   0  0.727981     0.853218  1.172033
1   1  1.997831     1.413447  0.707490
2   2  0.276823     0.526140  1.900636
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513

**Answer:** See A02.py

A02 used:

dt_true['ratio'] = dt_true['consumption']/dt_true['income']

## Summary statistics

Produce summary statistics using `.describe()`.

In [4]:
# write your code here
dt.describe()

               id      income  consumption       ratio
count  100.000000  100.000000   100.000000  100.000000
mean    49.500000    1.415547     1.087844    1.117517
std     29.011492    1.322203     0.484238    0.525452
min      0.000000    0.108402     0.329245    0.351134
25%     24.750000    0.529323     0.727545    0.752310
50%     49.500000    0.981178     0.990533    1.009580
75%     74.250000    1.768211     1.329572    1.374491
max     99.000000    8.110612     2.847914    3.037255

**Answer:** See A03.py

## Indexing

Select everybody with an income above 1.

In [5]:
# write your code here
dt.loc[dt['income']>1].head()

   id    income  consumption     ratio
1   1  1.997831     1.413447  0.707490
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513
6   6  2.574032     1.604379  0.623294
7   7  2.475478     1.573365  0.635580

In [6]:
#Alternative solution

I = dt['income'] > 1

dt.loc[I].head()

   id    income  consumption     ratio
1   1  1.997831     1.413447  0.707490
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513
6   6  2.574032     1.604379  0.623294
7   7  2.475478     1.573365  0.635580

**Answer:** See A04.py

Select everybody with an income *above* 1 and a ratio *above* 0.7.

In [7]:
# write your code here
I &= dt['ratio']>0.7

dt.loc[I].head()

    id    income  consumption     ratio
1    1  1.997831     1.413447  0.707490
3    3  1.481931     1.217346  0.821459
4    4  1.235904     1.111712  0.899513
11  11  2.031708     1.425380  0.701567
18  18  1.280235     1.131475  0.883802

In [8]:
#Alternative code
I = (dt['income'] > 1) & (dt['ratio']>0.7)
# we should add parentheses to ensure that the
# comparison operators are evaluated before the logical operator:
dt.loc[I].head()

    id    income  consumption     ratio
1    1  1.997831     1.413447  0.707490
3    3  1.481931     1.217346  0.821459
4    4  1.235904     1.111712  0.899513
11  11  2.031708     1.425380  0.701567
18  18  1.280235     1.131475  0.883802

**Answer:** See A05.py

Set consumption equal to 0.5 if income is less than 0.5.

In [9]:
# write your code here
dt.loc[dt.income < 0.5, ['consumption']] = 0.5
dt.head()
#dt['consumption'].mean() # <- compare with answer

   id    income  consumption     ratio
0   0  0.727981     0.853218  1.172033
1   1  1.997831     1.413447  0.707490
2   2  0.276823     0.500000  1.900636
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513

**Answer:**  See A06.py

In [10]:
#alternative code:
I = (dt['income'] < 0.5)
dt.loc[I, ['consumption']] = 0.5
dt.head()

   id    income  consumption     ratio
0   0  0.727981     0.853218  1.172033
1   1  1.997831     1.413447  0.707490
2   2  0.276823     0.500000  1.900636
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513

Set consumption equal to income if income is less than 0.5.

In [11]:
# write your code here
I = dt['income'] < 0.5
dt.loc[I,['consumption']]=dt['income']
dt.head()
# dt['consumption'].mean() # <- compare with answer

   id    income  consumption     ratio
0   0  0.727981     0.853218  1.172033
1   1  1.997831     1.413447  0.707490
2   2  0.276823     0.276823  1.900636
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513

**Answer:** See A07.py

In [12]:
I = (dt['income'] < 0.5)
dt.loc[I, ['consumption']] = dt.loc[I, ['income']].values
#uses the numpy function .values
dt['consumption'].mean()
dt.head()

   id    income  consumption     ratio
0   0  0.727981     0.853218  1.172033
1   1  1.997831     1.413447  0.707490
2   2  0.276823     0.276823  1.900636
3   3  1.481931     1.217346  0.821459
4   4  1.235904     1.111712  0.899513

## Dropping

Drop the *ratio* variable and all rows with an income above 1.5. After this, also drop the first 5 rows.

In [13]:
print(f'before: {dt.shape[0]} observations, {dt.shape[1]} variables')
# write your code here

#drop ratio variable
dt.drop(['ratio'],axis=1,inplace=True) 

#drop income > 1.5
I = dt['income'] > 1.5
dt = dt[I==False]

#drop first 5 rows
dt = dt.iloc[5:,:]




print(f'after: {dt.shape[0]} observations, {dt.shape[1]} variables')

before: 100 observations, 4 variables
after: 65 observations, 3 variables

**Answer:** see A08.py

Alternative code #1:

dt_true.drop('ratio',axis=1,inplace=True)
I = dt_true['income'] > 1.5
dt_true.drop(dt_true[I].index,inplace=True)
dt_true.drop(dt_true.loc[:5].index,inplace=True)

The third line uses the drop method to remove the rows that match the boolean mask I from the DataFrame dt_true. This is done by calling dt_true[I].index to get the indices of the rows to be removed, and passing those indices to the drop method.

The fourth line drops the first five rows of the DataFrame using the loc indexer to select the rows with indices from 0 to 5 (inclusive), and passing those indices to the drop method.

Alternative code #2:
del dt_alt['ratio']
I = dt_alt['income'] > 1.5
dt_alt = dt_alt[~I]
dt_alt = dt_alt.iloc[5:,:]
print(f'after (alt): {dt_alt.shape[0]} observations, {dt_alt.shape[1]} variables')


The second line creates a boolean mask I that selects rows where the income column is greater than 1.5, similar to the previous example.

The third line then creates a new DataFrame dt_alt that includes all the rows of the original dt_alt DataFrame that do not match the boolean mask I. This is done using the tilde (~) operator, which negates the boolean values of the I mask. So the expression ~I selects all the rows where income is less than or equal to 1.5.

## Renaming

Rename *consumption* to *cons* and *income* to *inc*.

In [14]:
# write your code
dt.rename(columns={'consumption':'cons','income':'inc'}, inplace=True)


dt.head()

    id       inc      cons
8    8  0.582074  0.762938
10  10  0.932044  0.965424
12  12  0.356952  0.356952
13  13  0.379825  0.379825
16  16  0.700896  0.837195

**Answer:** see A09.py

## Functions

Correct the wrong lines such that `assets_1 = assets_2 = assets_3 = assets_4`.

In [15]:
def assets_row_by_row(x,R,Y):
    #return 0 # wrong line
    return R*(x['inc']-x['cons'])+Y
    
def assets_all_at_once(inc,cons,R,Y):
    #return 0 # wrong line
    return R*(inc-cons)+Y

def assets_adj(assets,R,Y):
    # missing lines
    return R*assets+Y
    

R = 1.2 # return rate
Y = 1 # income
try:
    dt['assets_1'] = R*(dt['inc']-dt['cons'])+Y
    dt['assets_2'] = dt.apply(assets_row_by_row,axis=1,args=(R,Y))
    dt['assets_3'] = assets_all_at_once(dt['inc'].values,dt['cons'].values,R,Y)
    dt['assets_4'] = dt['inc']-dt['cons']
    dt['assets_4'] = dt['assets_4'].apply(assets_adj,R=R, Y=Y)
except:
    print('failed')
dt.head()

    id       inc      cons  assets_1  assets_2  assets_3  assets_4
8    8  0.582074  0.762938  0.782963  0.782963  0.782963  0.782963
10  10  0.932044  0.965424  0.959943  0.959943  0.959943  0.959943
12  12  0.356952  0.356952  1.000000  1.000000  1.000000  1.000000
13  13  0.379825  0.379825  1.000000  1.000000  1.000000  1.000000
16  16  0.700896  0.837195  0.836441  0.836441  0.836441  0.836441

**Answer:** see A10.py

def assets_row_by_row(x,R,Y):
    return R*(x['inc']-x['con'])+Y
    
def assets_all_at_once(income,consumption,R,Y):
    return R*(inc-cons)+Y

def assets_adj(assets,R,Y):
    assets *= R
    assets += Y

R = 1.2 # return rate
Y = 1 # income
dt_true['assets_1'] = R*(dt_true['inc']-dt_true['con'])+Y
dt_true['assets_2'] = dt_true.apply(assets_row_by_row,axis=1,args=(R,Y))
dt_true['assets_3'] = assets_all_at_once(dt_true['inc'].values,dt_true['con'].values,R,Y)
dt_true['assets_4'] = dt_true['inc']-dt_true['con']
assets_adj(dt_true['assets_4'],R,Y)

#CHR: Maybe more intuitive solution for assets_4

dt_true.head()

# Problem

Load the data set in *data/NAH1_pivoted.xlsx* and clean and structure it such that the `plot_timeseries(dataframe)` below can be run and produce an interactive figure.

In [16]:
def _plot_timeseries(dataframe, variable, years):
    
    fig = plt.figure(dpi=100)
    ax = fig.add_subplot(1,1,1)
    
    dataframe.loc[:,['year']] = pd.to_numeric(dataframe['year'])
    I = (dataframe['year'] >= years[0]) & (dataframe['year'] <= years[1])
    
    x = dataframe.loc[I,'year']
    y = dataframe.loc[I,variable]
    ax.plot(x,y)
    
    ax.set_xticks(list(range(years[0], years[1] + 1, 5)))    
    
def plot_timeseries(dataframe):
    
    widgets.interact(_plot_timeseries, 
    dataframe = widgets.fixed(dataframe),
    variable = widgets.Dropdown(
        description='variable', 
        options=['Y','C','G','I','X','M'], 
        value='Y'),
    years=widgets.IntRangeSlider(
        description="years",
        min=1966,
        max=2018,
        value=[1980, 2018],
        continuous_update=False,
    )                 
);

**Hint 1:** You can base your renaming on this dictionary:

In [31]:
rename_dict = {}
rename_dict['Unnamed: 0'] = 'year'
rename_dict['P.1 Output'] = 'Y'
rename_dict['P.3 Final consumption expenditure'] = 'C'
rename_dict['P.3 Government consumption expenditure'] = 'G'
rename_dict['P.5 Gross capital formation'] = 'I'
rename_dict['P.6 Export of goods and services'] = 'X'
rename_dict['P.7 Import of goods and services'] = 'M'

**Hint 2:** You code should have the following structure:

In [35]:
nah1.head()

,Unnamed: 0,Unnamed: 1,P.1 Output,P.11 Market output,P.12 Output for own final use,P.13 Non-market output,P.131 Payment for other non-marked output,P.132 Other non-market output,P.11+P.12+P.131 Market output and output for own final use including payment for other non-marked output,D.21-D.31 Taxes less subsidies on products,...,P.32 Government collective consumption expenditure,P.5 Gross capital formation,P.51g Gross fixed capital formation,P.52+P.53 Changes in inventories etc.,P.52 Changes in inventories,P.53 Acquisitions less disposals of valuables,P.6 Export of goods and services,P.61 Export of goods,P.62 Export of services,Uses
0,1966,Current prices,144582.0,..,..,..,..,..,..,8860.0,...,5231.0,21134.0,20242.0,892.0,750.0,142.0,23110.0,16941.0,6169.0,177847.0
1,NaN,"2010-prices, chained values",1089347.0,..,..,..,..,..,..,97473.0,...,63369.0,127631.0,114728.0,-13109.0,32252.0,828.0,123594.0,83094.0,42570.0,1270295.0
2,1967,Current prices,155581.0,..,..,..,..,..,..,10308.0,...,5979.0,22851.0,22454.0,397.0,226.0,172.0,24289.0,17654.0,6636.0,192060.0
3,NaN,"2010-prices, chained values",1124579.0,..,..,..,..,..,..,113389.0,...,68175.0,133749.0,124490.0,-2688.0,741.0,967.0,128182.0,87606.0,42143.0,1326237.0
4,1968,Current prices,167877.0,..,..,..,..,..,..,12509.0,...,6957.0,25369.0,24369.0,1000.0,774.0,226.0,27320.0,19787.0,7533.0,209109.0

In [50]:
# a. load data set
# nah1 = ?

nah1 = pd.read_excel('data/NAH1_pivoted.xlsx', skiprows = 2)

# b. rename variables

nah1.rename(columns = rename_dict, inplace=True)

# c. remove rows where Y is nan

I = nah1['Y'].notna()
nah1 = nah1[I]

# d. correct year column data
# hint, nah1.loc[J,['year']] = nah1.loc[I,['year']].values

J = nah1['year'].isna()
I = nah1['year'].notna()

nah1.loc[J,['year']] = nah1.loc[I,['year']].values

# e. only keep rows with '2010-prices, chained values'

I = nah1['Unnamed: 1'].str.contains('2010-prices, chained values')
nah1=nah1[I]

# f. only keep renamed variables
nah1=nah1.loc[:,['year','Y','C','G','I','X','M']]


# g. interactive plot
plot_timeseries(nah1)

interactive(children=(Dropdown(description='variable', options=('Y', 'C', 'G', 'I', 'X', 'M'), value='Y'), Int…

In [51]:
nah1.head()

   year          Y         C         G         I         X         M
1  1966  1089347.0  549491.0  171307.0  127631.0  123594.0  112171.0
3  1967  1124579.0  588094.0  184983.0  133749.0  128182.0  120028.0
5  1968  1162778.0  612327.0  195664.0  142242.0  140746.0  127670.0
7  1969  1239121.0  649337.0  209375.0  164447.0  149184.0  144021.0
9  1970  1282852.0  671805.0  222350.0  168129.0  154880.0  157151.0

**Answer:** see A11.py

In [ ]:
plot_timeseries(nah1)

NameError: name 'nah1' is not defined

# Extra problems

## Extend interactive plot

Extend the interactive plot with a choice of *real* vs *nominal*.

## New data set

Load data from an Excel or CSV file you have downloaded from e.g. [Statistikbanken.dk](https://www.statistikbanken.dk/). Clean, structure and present the data as you see fit.